{
  "pets": [
    {
      "id": 4,
      "name": "Smokey",
      "origin": "United States",
      "temperament": "Active, Energetic, Intelligent",
      "colors": [
        "Brown Spotted",
        "Snow Spotted",
        "Marble"
      ],
      "description": "The Bengal cat is a medium to large-sized breed known for its wild appearance and energetic nature. They are highly intelligent and require mental and physical stimulation.",
      "url": "https://cdn2.thecatapi.com/images/9at.jpg"
    },
    {
      "id": 12,
      "name": "Petey",
      "origin": "Burma",
      "temperament": "Gentle, Affectionate, Sociable",
      "colors": [
        "Seal Point",
        "Blue Point",
        "Lilac Point",
        "Chocolate Point"
      ],
      "description": "The Birman cat is a gentle and affectionate breed known for its striking blue eyes and silky coat. They are social cats that enjoy spending time with their human companions.",
      "url": "https://cdn2.thecatapi.com/images/7ea.jpg"
    },
    {
      "id": 14,
      "name": "Nala",
      "origin": "United Kingdom",
      "temperament": "Active, Curious, Affectionate",
      "colors": [
        "White",
        "Black",
        "Blue",
        "Red"
      ],
      "description": "The Cornish Rex cat is an active and affectionate breed known for its soft and curly coat. They are social cats that enjoy being around people and other pets.",
      "url": "https://cdn2.thecatapi.com/images/ef9.jpg"
    },
    {
      "id": 17,
      "name": "Bobby",
      "origin": "United States",
      "temperament": "Affectionate, Intelligent, Playful",
      "colors": [
        "Seal Point",
        "Blue Point",
        "Chocolate Point",
        "Lilac Point"
      ],
      "description": "The Balinese cat is an affectionate and intelligent breed known for its long and silky coat. They are playful and enjoy interactive toys and games with their owners.",
      "url": "https://cdn2.thecatapi.com/images/MTk0NDg2MA.jpg"
    },
    {
      "id": 19,
      "name": "Zoe",
      "origin": "Singapore",
      "temperament": "Curious, Affectionate, Playful",
      "colors": [
        "Sepia Ticked",
        "Sable Ticked",
        "Black Ticked"
      ],
      "description": "The Singapura cat is a small and playful breed known for its ticked coat and large expressive eyes. They are curious cats that enjoy exploring their surroundings.",
      "url": "https://cdn2.thecatapi.com/images/HOrX5gwLS.jpg"
    },
    {
      "id": 20,
      "name": "Scooby",
      "origin": "United States",
      "temperament": "Affectionate, Social, Playful",
      "colors": [
        "Natural Mink",
        "Blue Mink",
        "Champagne Mink",
        "Platinum Mink"
      ],
      "description": "The Tonkinese cat is an affectionate and social breed known for its silky coat and striking aqua-colored eyes. They are playful and enjoy interactive play with their human companions.",
      "url": "https://cdn2.thecatapi.com/images/__tqyLW91.jpg"
    },
    {
      "id": 23,
      "name": "Rocket",
      "origin": "Russia",
      "temperament": "Reserved, Intelligent, Gentle",
      "colors": [
        "Blue"
      ],
      "description": "The Russian Blue cat is a reserved and intelligent breed known for its shimmering blue coat and emerald green eyes. They are loyal cats that form strong bonds with their families.",
      "url": "https://cdn2.thecatapi.com/images/ja.jpg"
    },
    {
      "id": 24,
      "name": "Rodeo",
      "origin": "Scotland",
      "temperament": "Sweet, Loving, Curious",
      "colors": [
        "White",
        "Black",
        "Blue",
        "Cream"
      ],
      "description": "The Scottish Fold cat is a sweet and loving breed known for its unique folded ears and round face. They are curious cats that enjoy interactive toys and games.",
      "url": "https://cdn2.thecatapi.com/images/6ta.jpg"
    },
    {
      "id": 27,
      "name": "Snowball",
      "origin": "Canada",
      "temperament": "Affectionate, Playful, Curious",
      "colors": [
        "White",
        "Black",
        "Blue",
        "Pink"
      ],
      "description": "The Sphynx cat is an affectionate and playful breed known for its hairless appearance and wrinkled skin. They enjoy cuddling to stay warm and need regular grooming to remove body oils.",
      "url": "https://cdn2.thecatapi.com/images/chn.jpg"
    },
    {
      "id": 28,
      "name": "Muffin",
      "origin": "Isle of Man",
      "temperament": "Loyal, Playful, Intelligent",
      "colors": [
        "Rumpy",
        "Riser",
        "Stumpy",
        "Longy"
      ],
      "description": "The Manx cat is a loyal and playful breed known for its taillessness or short tail. They are intelligent cats that enjoy interactive toys and puzzles.",
      "url": "https://cdn2.thecatapi.com/images/dr1.jpg"
    },
    {
      "id": 30,
      "name": "Beau",
      "origin": "Burma",
      "temperament": "Affectionate, Gentle, Sociable",
      "colors": [
        "Seal",
        "Blue",
        "Chocolate",
        "Lilac"
      ],
      "description": "The Birman cat is an affectionate and gentle breed known for its striking blue eyes and silky coat with color points on the ears, face, paws, and tail. They are sociable cats that enjoy interacting with their human companions.",
      "url": "https://cdn2.thecatapi.com/images/MTgwODMzNA.jpg"
    },
    {
      "id": 31,
      "name": "Bubba",
      "origin": "France",
      "temperament": "Loyal, Quiet, Intelligent",
      "colors": [
        "Blue"
      ],
      "description": "The Chartreux cat is a loyal and quiet breed known for its dense blue-gray coat and copper or gold eyes. They are intelligent cats that can be reserved around strangers.",
      "url": "https://cdn2.thecatapi.com/images/MTg1NDE0Mg.jpg"
    },
    {
      "id": 32,
      "name": "Pickles",
      "origin": "Turkey",
      "temperament": "Playful, Energetic, Sociable",
      "colors": [
        "White",
        "Red",
        "Cream"
      ],
      "description": "The Turkish Van cat is a playful and energetic breed known for its love of water and distinctive color pattern on the head and tail. They are sociable cats that enjoy interactive play and exploring new environments.",
      "url": "https://cdn2.thecatapi.com/images/2v7.jpg"
    },
    {
      "id": 33,
      "name": "Piglet",
      "origin": "Singapore",
      "temperament": "Curious, Affectionate, Intelligent",
      "colors": [
        "Sepia Agouti"
      ],
      "description": "The Singapura cat is a curious and affectionate breed known for its small size and sepia agouti coat. They are intelligent cats that enjoy interactive games and puzzles.",
      "url": "https://cdn2.thecatapi.com/images/4lt.gif"
    },
    {
      "id": 35,
      "name": "Margot",
      "origin": "Norway",
      "temperament": "Independent, Intelligent, Agile",
      "colors": [
        "Brown Tabby",
        "Blue Tabby",
        "Black",
        "White"
      ],
      "description": "The Norwegian Forest Cat is an independent and intelligent breed known for its long, thick fur and bushy tail. They are agile cats that enjoy climbing and exploring outdoor spaces.",
      "url": "https://cdn2.thecatapi.com/images/9sh.jpg"
    },
    {
      "id": 38,
      "name": "Cooper",
      "origin": "United States",
      "temperament": "Affectionate, Playful, Intelligent",
      "colors": [
        "Seal Point",
        "Blue Point",
        "Chocolate Point",
        "Lilac Point"
      ],
      "description": "The Balinese cat is an affectionate and playful breed known for its long fur and color points on the ears, face, paws, and tail. They are intelligent cats that enjoy interactive toys and games.",
      "url": "https://cdn2.thecatapi.com/images/MTY4NDM4Mg.jpg"
    },
    {
      "id": 39,
      "name": "Jay",
      "origin": "Egypt",
      "temperament": "Active, Agile, Intelligent",
      "colors": [
        "Silver",
        "Bronze"
      ],
      "description": "The Egyptian Mau is an active and agile breed known for its spotted coat and green eyes. They are intelligent cats that enjoy interactive play and hunting games.",
      "url": "https://cdn2.thecatapi.com/images/MTg3NjQ0Mg.jpg"
    }
  ],
  "tweets": [
    {
      "author": "Bob Carr",
      "quote": "Programming can be addictive."
    },
    {
      "author": "Fred Brooks",
      "quote": "Human beings are not accustomed to being perfect, and few areas of human activity demand it. Adjusting to the requirement for perfection is, I think, the most difficult part of learning to program."
    },
    {
      "author": "Danny Hillis",
      "quote": "With the right programming, a computer can become a theater, a musical instrument, a reference book, a chess opponent. No other entity in the world except a human being has such an adaptable, universal nature."
    },
    {
      "author": "Marijn Haverbeke",
      "quote": "There are many terrible mistakes to make in program design, so go ahead and make them so that you understand them better."
    },
    {
      "author": "David Gelernter",
      "quote": "Beauty is more important in computing than anywhere else in technology because software is so complicated. Beauty is the ultimate defense against complexity."
    },
    {
      "author": "Albert Einstein",
      "quote": "Any intelligent fool can make things bigger, more complex, and more violent. It takes a touch of genius – and a lot of courage – to move in the opposite direction."
    },
    {
      "author": "Fred Brooks",
      "quote": "The first false assumption that underlies the scheduling of systems programming is that all will go well, i.e., that each task will hike only as long as it \"ought\" to take. A large programming effort, however, consists of many tasks, some chained end-to-end. The probability that each will go well becomes vanishingly small."
    },
    {
      "author": "Robert C. Martin",
      "quote": "Cleaning code does NOT take time. NOT cleaning code does take time."
    },
    {
      "author": "Fred Brooks",
      "quote": "What one programmer can do in one month, two programmers can do in two months."
    },
    {
      "author": "Martin Fowler",
      "quote": "With testing, I know straight away when I added a bug. That lets me fix the bug immediately, before it can crawl off and hide."
    },
    {
      "author": "Tim Berners-Lee",
      "quote": "I don't believe in the sort of eureka moment idea. I think it's a myth. I'm very suspicious that actually Archimedes had been thinking about that problem for a long time."
    },
    {
      "author": "P. J. Plauger",
      "quote": "Hofstadter's Law: It always takes longer than you expect, even when you take into account Hofstadter's Law."
    },
    {
      "author": "Danny Hillis",
      "quote": "The computer is not just an advanced calculator or camera or paintbrush; rather, it is a device that accelerates and extends our processes of thought."
    },
    {
      "author": "Bjarne Stroustrup",
      "quote": "The most important single aspect of software development is to be clear about what you are trying to build."
    },
    {
      "author": "Donald Knuth",
      "quote": "Beware of bugs in the above code; I have only proved it correct, not tried it."
    },
    {
      "author": "Fred Brooks",
      "quote": "A programming systems product takes about nine times as much effort as the component programs written separately for private use."
    },
    {
      "author": "Charles Babbage",
      "quote": "We have already mentioned what may, perhaps, appear paradoxical to some of our readers, — that the division of labour can be applied with equal success to mental as to mechanical operations, and that it ensures in both the same economy of time."
    },
    {
      "author": "Richard Moore (engineer)",
      "quote": "The difference between theory and practice is that in theory, there is no difference between theory and practice."
    },
    {
      "author": "Rob Pike",
      "quote": "Fancy algorithms are slow when n is small, and n is usually small."
    },
    {
      "author": "Steve Jobs",
      "quote": "It is hard to think that a $2 billion company with 4,300-plus people couldn't compete with six people in blue jeans."
    },
    {
      "author": "Fred Brooks",
      "quote": "The general tendency is to over-design the second system, using all the ideas and frills that were cautiously sidetracked on the first one."
    },
    {
      "author": "Daniel T. Barry",
      "quote": "Most errors are introduced during requirements specification!"
    },
    {
      "author": "Poul Anderson",
      "quote": "I have yet to see any problem, however complicated, which when looked at in the right way, did not become more complicated."
    },
    {
      "author": "Fred Brooks",
      "quote": "When a task cannot be partitioned because of sequential constraints, the application of more effort has no effect on the schedule. The bearing of a child takes nine months, no matter how many women are assigned."
    },
    {
      "author": "Donald Knuth",
      "quote": "I’ve got this need to program. I wake up in the morning with sentences of a literate program. Before breakfast — I’m sure poets must feel this — I have to go to the computer and write this paragraph and then I can eat and I’m happy."
    },
    {
      "author": "Fred Brooks",
      "quote": "A programming systems product takes about nine times as much effort as the component programs written separately for private use."
    },
    {
      "author": "Edsger W. Dijkstra",
      "quote": "The use of COBOL cripples the mind; its teaching should, therefore, be regarded as a criminal offense."
    },
    {
      "author": "Ted Nelson",
      "quote": "The good news about computers is that they do what you tell them to do. The bad news is that they do what you tell them to do."
    },
    {
      "author": "Linus Torvalds",
      "quote": "An infinite number of monkeys typing into GNU Emacs would never make a good program."
    },
    {
      "author": "Ken Thompson",
      "quote": "One of my most productive days was throwing away 1,000 lines of code."
    },
    {
      "author": "Linus Torvalds",
      "quote": "Really, I'm not out to destroy Microsoft. That will just be a completely unintentional side effect."
    },
    {
      "author": "Alan Turing",
      "quote": "The idea behind digital computers may be explained by saying that these machines are intended to carry out any operations which could be done by a human computer."
    },
    {
      "author": "Rob Pike",
      "quote": "Object-oriented design is the roman numerals of computing."
    },
    {
      "author": "Daniel T. Barry",
      "quote": "Any technological or managerial scheme to force documentation can be subverted by unwilling programmers."
    },
    {
      "author": "Brian Kernighan",
      "quote": "The most effective debugging tool is still careful thought, coupled with judiciously placed print statements."
    },
    {
      "author": "P. J. Plauger",
      "quote": "Hofstadter's Law: It always takes longer than you expect, even when you take into account Hofstadter's Law."
    },
    {
      "author": "Danny Hillis",
      "quote": "Computers are the most complex objects we human beings have ever created, but in a fundamental sense they are remarkably simple."
    },
    {
      "author": "Ray Ozzie",
      "quote": "Complexity kills. It sucks the life out of developers, it makes products difficult to plan, build and test, it introduces security challenges and it causes end-user and administrator frustration."
    },
    {
      "author": "Wayne Ratliff",
      "quote": "Programming is a little bit like the army. Now that I'm out, it's neat to have had the experience."
    },
    {
      "author": "Harlan Mills",
      "quote": "The best way to know that you have found the last bug is never to find the first bug."
    }
  ],
  "yourPets": [ ]
}